# -*- org-use-property-inheritance: t; -*-
#+TITLE: Howto Setup a remote ii socket / pair session
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+CREATOR: ii.coop
#+DATE: October 8th, 2018
#+PROPERTY: header-args :dir (file-name-directory buffer-file-name)
#+PROPERTY: header-args:shell :results silent
#+PROPERTY: header-args:shell :exports code
#+PROPERTY: header-args:shell :wrap "SRC text"
#+PROPERTY: header-args:tmux :socket "/tmp/crt-tmate.socket"
#+PROPERTY: header-args:tmux :session crt:main

*** Connecting the right pair / isocket

#+NAME: right_session_create
#+BEGIN_SRC shell :var session="root-right" terminal_exec="xterm -e" user="root" host="apisnoop.cncf.io" :session nil :results silent
  $terminal_exec \
      "ssh -att \
           -L /tmp/.$session.isocket:/tmp/.$session.isocket \
           -l $user \
           $host \
      tmate -S /tmp/.$session.isocket \
            new-session \
            -A \
            -s $session \
            -n misc" \
  &
#+END_SRC


 #+NAME: right_session_join
 #+BEGIN_SRC shell :results silent
 export SESSION=api-snoop
 export XTERM_EXEC="roxterm -e"
 $XTERM_EXEC ssh -Att root@apisnoop.cncf.io \
  tmate -S /tmp/.$SESSION.isocket \
   at \; sleep 9999
 #+END_SRC

 #+NAME: right_session_setup
 #+BEGIN_SRC shell :results verbatim
 export SESSION=api-snoop
 echo ssh -tt root@apisnoop.cncf.io \
  tmate -S /tmp/.$SESSION.isocket \
    new-window -n session \
     bash
 #+END_SRC

 #+NAME: right_session
 #+BEGIN_SRC shell :cache yes :wrap "SRC text :noeval" :results verbatim
 export SESSION=api-snoop
 ssh -tt root@apisnoop.cncf.io \
  tmate -S /tmp/.$SESSION.isocket display -p \'#{tmate_ssh}\'
 #+END_SRC

 #+RESULTS[dd96525b42bbbe741e292e99ad5f3592a7163025]: right_session
 #+BEGIN_SRC text :noeval
 ssh mJrsCgvGTOTOFagYpBKvRf7EE@sf2.tmate.io
 #+END_SRC





 #+NAME: give this to your pair
 #+BEGIN_SRC bash :noweb yes :var left_session=left_session() right_session=right_session()
 echo "ii pair session ready
 left: $left_session
 right: $right_session
 "
 #+END_SRC

 #+RESULTS: give this to your pair
 | ii     | pair | session | ready |
 | left:  | nil  |         |       |
 | right: | nil  |         |       |
 |        |      |         |       |

** Connecting the right pair / isocket

#+NAME: right_session_create
#+BEGIN_SRC shell :results silent
export WORKDIR=~/org/
export XTERM_EXEC="xterm -e"
export SESSION_PREFIX=rt-
export SESSION=hack
export SESSION_WITH_PREFIX=${SESSION_PREFIX}${SESSION}
echo $WORKDIR
$XTERM_EXEC ssh -Att root@apisnoop.cncf.io \
 cd $WORKDIR \; \
 tmate -S /tmp/.$SESSION_WITH_PREFIX.isocket \
  new-session \
  -A -c $WORKDIR -s $SESSION_WITH_PREFIX -n main &
#+END_SRC

#+NAME: right_session_join
#+BEGIN_SRC shell :results silent
export WORKDIR=~/org/
export XTERM_EXEC="xterm -e"
export SESSION_PREFIX=rt-
export SESSION=hack
export SESSION_WITH_PREFIX=${SESSION_PREFIX}${SESSION}
$XTERM_EXEC ssh -Att root@apisnoop.cncf.io \
 tmate -S /tmp/.$SESSION_WITH_PREFIX.isocket \
  at \; sleep 9999
#+END_SRC

#+NAME: right_session_setup
#+BEGIN_SRC shell :results verbatim
export SESSION_PREFIX=rt-
export SESSION=hack
export SESSION_WITH_PREFIX=${SESSION_PREFIX}${SESSION}
echo ssh -tt root@apisnoop.cncf.io \
 tmate -S /tmp/.$SESSION_WITH_PREFIX.isocket \
   new-window -n session \
    bash 
#+END_SRC

#+RESULTS: right_session_setup
#+BEGIN_SRC text
ssh -tt root@apisnoop.cncf.io tmate -S /tmp/.rt-hack.isocket new-window -n session bash
#+END_SRC

#+NAME: right_session
#+BEGIN_SRC shell :cache yes
export SESSION=rt-hack
ssh -tt root@apisnoop.cncf.io \
 tmate -S /tmp/.$SESSION.isocket display -p \'#{tmate_ssh}\'
#+END_SRC

#+RESULTS[161f53350123bd9d246fde4c6271404629c9499d]: right_session
#+BEGIN_SRC text
ssh vVDZubujOONeweLJVWwv449nA@sf2.tmate.io
#+END_SRC



#+NAME: give this to your pair
#+BEGIN_SRC bash :noweb yes :var left_session=left_session() right_session=right_session() 
echo "ii pair session ready
left: $left_session
right: $right_session
"
#+END_SRC

#+RESULTS: give this to your pair
| ii     | pair | session | ready |
| left:  | nil  |         |       |
| right: | nil  |         |       |
|        |      |         |       |

